
const test = [
{
    eventId: 43492030,
    team1: 'Кампала Куинс (ж)',
    team2: 'УКУ Леди Кардиналс (ж)',
    rate1: { '1699171739133': '1.09' },
    ratex: { '1699171739137': '0' },
    rate2: { '1699171739143': '0' }
  },
  {
    eventId: 43514499,
    team1: 'Наполи (Abodykz)',
    team2: 'Интер (ISCO)',
    rate1: { '1699171739155': '0' },
    ratex: { '1699171739161': '0' },
    rate2: { '1699171739164': '0' }
  },
  {
    eventId: 43520735,
    team1: 'Ман. Сити (Jekunam)',
    team2: 'Тоттенхэм (Koftovsky)',
    rate1: { '1699171739267': '2.07' },
    ratex: { '1699171739333': '4.30' },
    rate2: { '1699171739338': '2.77' }
  },
  {
    eventId: 43520738,
    team1: 'Ливерпуль (GianniKid)',
    team2: 'Ман. Юнайтед (JeyXmaniA)',
    rate1: { '1699171739363': '2.25' },
    ratex: { '1699171739367': '3.55' },
    rate2: { '1699171739371': '2.85' }
  },
  {
    eventId: 43520813,
    team1: 'Арсенал (labotryas)',
    team2: 'Боруссия Д (BlackStar98)',
    rate1: { '1699171739395': '2.65' },
    ratex: { '1699171739401': '3.30' },
    rate2: { '1699171739412': '2.52' }
  },
  {
    eventId: 43520827,
    team1: 'Атлетико М (FEARGGWP)',
    team2: 'Наполи (Flewless_phoenix)',
    rate1: { '1699171739431': '2.32' },
    ratex: { '1699171739434': '3.05' },
    rate2: { '1699171739438': '3.15' }
  }
]

console.log(Object.values(test.rate1));